---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ExternalServiceOptions
source: html/80467d42-3f13-de3e-cd06-bf3b43afefe0.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceOptions

Various options affecting the behavior of an External Service

## Syntax (C#)
```csharp
public class ExternalServiceOptions : IDisposable
```

## Remarks
Options are provided at the time of registering a service.
 After a service is registered, the options cannot be changed.